Revit 2027 API
CompoundStructureLayer.LayerId Property
 The id of the layer - note that this may be different from the index in the array of layers in a CompoundStructure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int LayerId { get; }
Public ReadOnly Property LayerId As Integer
	Get
public:
property int LayerId {
	int get ();
}
member LayerId : int with get
Property Value
Int32
See Also
Reference
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace